var citiesAndProvincesList = {
    "تهران": ["تهران", "شهریار", "اسلام شهر"],
    "خراسان رضوی": ["مشهد", "نیشابور", "بینالود", "کاشمر", "چناران", "سبزوار"],
    "اصفهان": ["اصفهان", "اردستان", "خمینی‌ شهر"],
    "فارس": ["آباده", "ارسنجان", "استهبان", "اقلید"],
    "خوزستان": ["اهواز", "آبادان", "دزفول", "خرمشهر", "شوشتر"],
    "آذربایجان شرقی": ["تبریز"],
    "مازندران": ["ساری", "بوشهر", "بابل"],
    "آذربایجان غربی	": ["ارومیه", "اشنویه"],
    "کرمان": ["بم", "رفسنجان", "سیرجان"],
    "سیستان و بلوچستان": ["زاهدان", "زابل"],
    "البرز": ["کرج"],
    "گیلان": ["لاهیجان", "آستارا"],
    "کرمانشاه": ["کرمانشاه", "قصر شیرین", "پاوه"],
    "گلستان": ["گرگان", "گنبد کاووس"],
    "هرمزگان": ["بندر عباس", "کیش", "هرمز"],
    "لرستان": ["بروجرد"],
    "همدان": ["همدان", "نهاوند"],
    "کردستان": ["سنندج", "مریوان", "سقز", "	بانه"],
    "مرکزی": ["اراک", "ساوه"],
    "قم": ["قم"],
    "قزوین": ["قزوین", "تاکستان"],
    "اردبیل": ["اردبیل", "خلخال"],
    "بوشهر": ["بوشهر"],
    "یزد": ["یزد", "اردکان", "هرات"],
    "زنجان": ["زنجان", "سلطانیه", "خدابنده", "ماهنشان"],
    "چهارمحال و بختیاری": ["شهرکرد"],
    "خراسان شمالی": ["بجنورد", "جاجرم"],
    "خراسان جنوبی": ["بیرجند", "طبس", "نهبندان"],
    "کهگیلویه و بویراحمد": ["یاسوج"],
    "سمنان": ["سمنان", "شاهرود", "دامغان", "گرمسار", "کلاته"],
    "ایلام": ["ایلام", "ایوان", "دهلران"]
};
var userProvince = prompt("استان مورد نظر را وارد کنید:");
if (citiesAndProvincesList[`${userProvince}`] === undefined) {
    alert("لطفا استان را به درستی وارد کنید");
} else {
    console.log(citiesAndProvincesList[`${userProvince}`]);
}